package Algorithms.Shower;

public class shower {
    public static void main(String[] args) {
        // устал писать код, время псевдокода.
        //* 1) Раздеться
        //   1.1) проверка на голытьбу
        //  2) забыть что-то
        //  2.1) */найти полотенце
        //  2.2) /*взять полотенце
        //  3) открыть дверь в ванную
        //  3.1) повесить полотенце
        //  3.2) закрыть дверь в ванную
        //  4) включить воду
        //  4.1) сбалансировать потоки
        //  5) взять мыльные принадлежности
        //  5.1) if нужна губка -> взять её
        //  6) нанести моющее средство на кожу
        //  7) втирательно-поступательными движениями распределить по всему телу
        //  7.1) уделить особое внимание грязным местам
        //  8) смыть мыльный состав
        //  9) выключить воду
        //  10) выйти
        // */
        System.out.println("МАРИНА, ПРИНЕСИ ПОЛОТЕНЦЕЕЕ!!!");
    }
}
